Revit 2027 API
GradientBackgroundSettings Class
 Represents the view gradient background settings.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BackgroundSettings
 Autodesk.Revit.DB.GradientBackgroundSettings
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class GradientBackgroundSettings : BackgroundSettings
Public Class GradientBackgroundSettings
	Inherits BackgroundSettings
public ref class GradientBackgroundSettings : public BackgroundSettings
type GradientBackgroundSettings =
    class
        inherit BackgroundSettings
    end
The GradientBackgroundSettings type exposes the following members.
Properties
Name | Description
GroundColor |  The color of the ground.
HorizonColor |  The color of the horizon.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from BackgroundSettings)
SkyColor |  The color of the top of the sky.
Top
Methods
Name | Description
Dispose
(Inherited from BackgroundSettings)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
Remarks
 The colors of the background are interpolated for the pixels corresponding to the sky - from the "sky color" (top) to the "horizon color" (bottom). The ground is represented with a solid color ("ground color").
See Also
Reference
Autodesk.Revit.DB Namespace